package ru.gb.book_distribution;

public class Homework {
    /*
    * 0 - Переварить всё, что было изучено
    * 1 - Доделать сервис управление книгами:
    * 1.1 - Реализовать контроллер по управление книгами с ручками:
    *   Get /book/{id} - получить описание книги,
    *   Delete /book/{id} - удалить книгу,
    *   Post /book - создать книгу
    * 1.2 - Реализовать коннтроллер по управлению читателями(аналогично контроллеру с книгами 1.1)
    * 1.3 - В контроллере issueController добавить ресурс: Get /issue/{id} - получить описания факта выдачи
    *
    * 2.1 - В сервис issueService добавить проверку, что у пользователя на руках нет книг. Если есть - не выдавать книгу (статус ответа - 404 Conflict)
    * 2.2 - В сервис читателя добавить ручку Get /reader/{id}/issue - вернуть список всех выдачей для данного читателя
    *
    *    *    * */
}
